W9D2/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE (id IN ([#<Artwork id: 4>, #<ArtworkShare id: nil, artwork_id: 4>]))
---
  def index
    # ids = Artwork.where(artist_id: params[:user_id]).ids + ArtworkShare.where(viewer_id: params[:user_id]).pluck(:artwork_id)
    # artworks = Artwork.where(id: ids)
    artworks = Artwork.find_artworks(params[:user_id])