W9D5/music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
    @band = Band.find(params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "yr", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "Dark Side of the Moon"], ["yr", 1973], ["created_at", "2019-04-12 22:30:05.385198"], ["updated_at", "2019-04-12 22:30:05.385198"]]

  def edit
    @album = Album.find(params[:id])
    @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Pooper at the Gates of Dawn"], ["updated_at", "2019-04-12 23:00:21.050525"], ["id", 8]]