W9D5/music_app/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @bands = Band.all

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    ensure_logged_in
    @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]
---
  def destroy
    ensure_logged_in
    @band = Band.find(params[:id])
    @band.destroy