W9D5/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vyQHK1H6apctxA"], ["updated_at", "2019-04-12 18:00:33.995510"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = self.class.generate_session_token
    self.save