W13D4/todos_app/todos_app/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "stupid mistakes"], ["body", "no more of em "], ["created_at", "2019-05-09 21:30:27.206244"], ["updated_at", "2019-05-09 21:30:27.206244"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save