W9D3/app_99_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "name", "color", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["description", "smelly smelly smelly"], ["updated_at", "2019-04-10 21:42:36.845644"], ["id", 3]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 8]]
---
    def destroy
        @cat = Cat.find(params[:id])
        @cat.destroy